/** 県庁所在地 定数クラス */
export class PrefectureCoordinates {
    static readonly test = "test"
    static readonly coordinates: { [key: string]: { lat: number; lng: number } } = {
        北海道: { lat: 43.064310, lng: 141.346879 },
        青森県: { lat: 40.824589, lng: 140.740548 },
        岩手県: { lat: 39.703526, lng: 141.152696 },
        宮城県: { lat: 38.268579, lng: 140.872072 },
        秋田県: { lat: 140.872072, lng: 140.102381 },
        山形県: { lat: 38.240434, lng: 140.363690},
        福島県: { lat: 37.750029, lng: 140.467771},
        茨城県: { lat: 36.341737, lng: 140.446824},
        栃木県: { lat: 36.565912, lng: 139.883592},
        群馬県: { lat: 36.390688, lng: 139.060453},
        埼玉県: { lat: 35.857033, lng: 139.649012},
        東京都: { lat: 35.689501, lng: 139.691722},
        神奈川県: { lat: 35.447734, lng: 139.642537},
        新潟県: { lat: 37.902451, lng: 139.023245},
        富山県: { lat: 36.695265, lng: 137.211305},
        石川県: { lat: 36.594606, lng: 136.625669},
        福井県: { lat: 36.065209, lng: 136.221720},
        山梨県: { lat: 35.664108, lng: 138.568455},
        長野県: { lat: 36.651306, lng: 138.180904},
        岐阜県: { lat: 35.391174, lng: 136.723657},
        静岡県: { lat: 34.976944, lng: 138.383056},
        愛知県: { lat: 35.180209, lng: 136.906582},
        三重県: { lat: 34.730278, lng: 136.508611},
        滋賀県: { lat: 35.004513, lng: 135.868568},
        京都府: { lat: 35.021242, lng: 135.755613},
        大阪府: { lat: 34.686344, lng: 135.520037},
        兵庫県: { lat: 34.691257, lng: 135.183078},
        奈良県: { lat: 34.685274, lng: 135.832861},
        和歌山県: { lat: 34.226111, lng: 135.167500},
        鳥取県: { lat: 35.468950, lng: 134.238261},
        島根県: { lat: 35.468950, lng: 133.048375},
        岡山県: { lat: 34.661758, lng: 133.934447},
        広島県: { lat: 34.396560, lng: 132.459622},
        山口県: { lat: 34.185833, lng: 131.471389},
        徳島県: { lat: 34.065770, lng: 134.559303},
        香川県: { lat: 34.340149, lng: 134.043444},
        愛媛県: { lat: 33.841669, lng: 132.766111},
        高知県: { lat: 33.559722, lng: 133.531111},
        福岡県: { lat: 33.606389, lng: 130.418056},
        佐賀県: { lat: 33.249367, lng: 130.298822},
        長崎県: { lat: 32.744722, lng: 129.873611},
        熊本県: { lat: 32.789722, lng: 130.741667},
        大分県: { lat: 33.238056, lng: 131.612500},
        宮崎県: { lat: 31.911111, lng: 131.423889},
        鹿児島県: { lat: 31.560278, lng: 130.558056},
        沖縄県: { lat: 26.212401, lng: 127.680932 }
    };

    static getCoordinates(prefectureName: string): { lat: number; lng: number } | undefined {
        return this.coordinates[prefectureName];
    }
}